/****************************************************************
*****************                            ********************
*****************************************************************
*  GSM.                                                        *
* ------------------------------------------------------------- *
*  АВТОР: Почепцов Олег Анатольевич	   												  *
* ------------------------------------------------------------- *
*****************************************************************/
#ifndef GSM_H_
#define GSM_H_

#include "uart.h"
#include "string.h"
#include "stm32f1xx_hal.h"

// Инициализация GSM
//------------------
void GSM_Init(UART_HandleTypeDef *gsm_uart, UART_HandleTypeDef *user_uart);

void Send2Site(UART_HandleTypeDef *gsm_uart, UART_HandleTypeDef *user_uart);

#endif
