/****************************************************************
*****************                            ********************
*****************************************************************
*  UART.                                                        *
* ------------------------------------------------------------- *
*  АВТОР: Почепцов Олег Анатольевич	   												  *
* ------------------------------------------------------------- *
*****************************************************************/
#ifndef UART_H_
#define UART_H_
#include "stm32f1xx_hal.h"

#define SIZE_RXBUFF 512


// Приемный буффер UART
extern uint8_t rx_buff[SIZE_RXBUFF];

// Инициализация UART
//------------------
void UART_Init( UART_HandleTypeDef *handle);

// Приём символа через UART
// -----------------------
// - возвращает -1 если буфер приёма пуст, иначе принятый символ
//
extern int UART_getc( void );

// Передача строки из n символов через UART
// ---------------------------------------
// - возвращает 1 если строка помещена в буфер передачи, иначе 0
//
extern int UART_putn( const char * s, int n );

#endif
